<?php
class ajax_info_cont
	{
	public $db;
	private $cms;
	/*===========================================================================================*/
	public function __construct($db_in, $cms)
    	{				
		$this->db = & $db_in;
		$this->cms = & $cms;
		}
	/*===========================================================================================*/
	public function __destruct()
    	{	
		}	
	/*===========================================================================================*/
	public function out()
		{
		if ($_POST['act'] == 'save')
			{
			$errors_html = "";
			$args = array(
					"id" 			=> $_POST['id'],
					"name" 			=> $_POST['name'],
					"aliace"		=> $_POST['aliace'],
					"pagetitle"		=> $_POST['pagetitle'],
					"description"	=> $_POST['description'],
					"keywords" 		=> $_POST['keywords'],
					"vis"			=> $_POST['vis'],
					"text"			=> $_POST['text']
					);
			if ($_POST['id'] == "-1") //создаем новый
				{
				if ($this->cms->info->getInfoByAliace($_POST['aliace'])) //проверяем есть ли такой алиас
					{
					$errors_html .= "Такой алиас уже занят!<br />";
					}
				if ($_POST['aliace'] == "")
					{
					$errors_html .= "Введите алиас!<br />";
					}
				if ($_POST['name'] == "")
					{
					$errors_html .= "Введите название!<br />";
					}	
					
				if ($errors_html == "") //если ошибок нет, то создаем
					{
					if (!($newid = $this->cms->info->new_info($args)))
						{
						$errors_html .= "Неизвестная ошибка<br />";
						}
					}
				}
			else   //сохраняем существующий
				{
				}
				
			if ($errors_html == "")
				{
				$res = array("ok"=>"yes");
				}
			else
				{
				$res = array("ok"=>"no","error"=>$errors_html);
				}
			echo json_encode($res);
			}
		}
	/*===========================================================================================*/
	
	/*===========================================================================================*/
	
	/*===========================================================================================*/
	
	/*===========================================================================================*/
	
	/*===========================================================================================*/
	}
?>